% 该文件用于处理数据，详情查看README文件
clc;
clear;

% 波长
lamuda = 652.8;

%记录数据
x11 = [0,2.3,3.0,7.5,9.5,10.5,11.7,14.5,16.7,17.6,18.9,21.7,23.4];%正行程位移变化时电压
x12 = [0,2.0,3.4,4.4,6.4,9.7,11.5,13.5,15.2,16.4,19.2,21.5,23.4];%负行程位移变化时电压

x21 = [0,1.4,3.2,6.5,7.9,9.2,10.4,12.6,15.5,16.6,17.6,20.6,22.3];%正行程位移变化时电压
x22 = [0,2.2,3.6,4.6,6.5,7.9,10.8,12.2,14.3,15.7,18.7,21,22.3];%负行程位移变化时电压


x13 = (0:x11(1,13)/12:x11(1,13));
y13 = 5000/150*x13;      %根据压电陶瓷电压计算位移真值，150V时位移5um，误差10%
y11 = lamuda/8*(0:1:12); %计算测量出的理论位移

%曲线拟合
[p1,S1] = polyfit([x11,x12],[y11,y11],1);
[y1_fit,delta1] = polyval(p1,x13,S1);

% 画第1次测量曲线
subplot(1,2,1);
hold on;
plot(x11,y11);
plot(x12,y11);
plot(x13,y13);
plot(x13,y1_fit);
legend('正行程','负行程','真值','拟合');
xlabel('V(电压)');
ylabel('nm(位移)');
hold off;

fprintf("第一组数据标准差delta = %.2fnm\n",delta1(1));

x23 = 0:x21(1,13)/12:x21(1,13);
y23 = 5000/150*x23;      %位移真值
y21 = lamuda/8*(0:1:12); %测量位移

%曲线拟合
[p2,S2] = polyfit([x21,x22],[y21,y21],1);
[y2_fit,delta2] = polyval(p2,x23,S2);

% 画第2次测量曲线
subplot(1,2,2);
hold on;
plot(x21,y21);
plot(x22,y21);
plot(x23,y23);
plot(x23,y2_fit);
legend('正行程','负行程','真值','拟合');
xlabel('V(电压)');
ylabel('nm(位移)');
hold off;

fprintf("第二组数据标准差delta = %.2fnm\n",delta2(1));
